docs(mcp-server): updated readme
